#include <stdio.h>
char *code = " \
[{'id':1,'이름':'김길동','결제일':20,'결제금액':50000},{'id':2,'이름':'나경원','결제일':23,'결제금액':40000},{'id':3,'이름':'최병원','결제일':28,'결제금액':50000},{'id':4,'이름':'나감자','결제일':15,'결제금액':30000},{'id':5},{'id':6},{'id':7},{'id':8},{'id':9},{'id':10},{'id':11},{'id':12},{'id':13},{'id':14},{'id':15},{'id':16},{'id':17},{'id':18},{'id':19},{'id':20},{'id':21}] \n\
" ;
int main( int argc , char** argv){
	FILE *pfile = NULL;
	pfile = fopen("학원회계","w");
	fputs(code,pfile);
	fclose(pfile);
	return 0;
}
			 
