angular.module('mySheet2',[])
.controller('mySheet2Ctrl', ['$scope','myhighLightRowService', function($scope, myhighLightRowService ){
	var working_row = 0 
	$scope.getSheetHeaderData[2] = function(){
		return vendor_colInfos
	}
	$scope.getSheetData[2] = function(){
		return vendor_data 
	}
	$scope.sheet2.getEntry = ( vendor )=>{
		const entry_customer = vendor_data.find((ent)=> ent['국내업체명'] == vendor )
		return entry_customer
	}
	$scope.event_click.sheet2 = ( args, activeSheetIndex )=>{
		if( activeSheetIndex != 2 )return 
			myhighLightRowService.unhighLightRow( $scope.spread, working_row, vendor_colInfos) 
			working_row = args.row 
			const sheet2 = $scope.spread.getSheet(2) 
			const No = sheet2.getValue( args.row, 0 ) 
			const ent1 = vendor_data.find((ent)=> ent.No == No )
			myhighLightRowService.highLightRow( $scope.spread, working_row, vendor_colInfos) 
	}
}]) 
var vendor_colInfos =[
  {
    "name": "no",
    "displayname": "no",
    "size": 70,
    "formatter": "\* ###",
    "locked": true 
  },
  {
    "name": "거래처구분",
    "displayname": "거래처구분",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "국내업체명",
    "displayname": "국내업체명",
    "size": 100,
    "formatter": "",
	"locked": false 
  },
  {
    "name": "성명",
    "displayname": "성명",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "부서",
    "displayname": "부서",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "직책",
    "displayname": "직책",
    "size": 100,
    "formatter": ""
  },
   {
    "name": "당사 담당자",
    "displayname": "당사 담당자",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "휴대전화",
    "displayname": "휴대전화",
    "size": 200,
    "formatter": ""
  },
  {
    "name": "전화",
    "displayname": "전화",
    "size": 200,
    "formatter": ""
  },
  {
    "name": "FAX",
    "displayname": "FAX",
    "size": 200,
    "formatter": ""
  },
  {
    "name": "대표 E-Mail",
    "displayname": "대표 E-Mail",
    "size": 200,
    "formatter": ""
  },
  {
    "name": "E-Mail\n(세금계산서)",
    "displayname": "E-Mail\n(세금계산서)",
    "size": 200,
    "formatter": ""
  },
  {
    "name": "사업자번호",
    "displayname": "사업자번호",
    "size": 200,
    "formatter": ""
  },
  {
    "name": "업체명\n(사업자등록증)",
    "displayname": "업체명\n(사업자등록증)",
    "size": 300,
    "formatter": ""
  },
  {
    "name": "대표자",
    "displayname": "대표자",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "주소",
    "displayname": "주소",
    "size": 1000,
    "formatter": ""
  },
  {
    "name": "업태",
    "displayname": "업태",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "종목",
    "displayname": "종목",
    "size": 200,
    "formatter": ""
  },
  {
    "name": "사전송금\n대상",
    "displayname": "사전송금\n대상",
    "size": 300,
    "formatter": ""
  },
  {
    "name": "비고표시",
    "displayname": "비고표시",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "배송안내\n메일구분",
    "displayname": "배송안내\n메일구분",
    "size": 300,
    "formatter": ""
  },
  {
    "name": "배송방법",
    "displayname": "배송방법",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "MSDS\n제공방법",
    "displayname": "MSDS\n제공방법",
    "size": 300,
    "formatter": ""
  },
  {
    "name": "계산서발행구분",
    "displayname": "계산서발행구분",
    "size": 300,
    "formatter": ""
  },
  {
    "name": "계산서발행시기",
    "displayname": "계산서발행시기",
    "size": 300,
    "formatter": ""
  },
  {
    "name": "배송주소",
    "displayname": "배송주소",
    "size": 1000,
    "formatter": ""
  },
  {
    "name": "우편번호",
    "displayname": "우편번호",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "거래명세서 발행구분",
    "displayname": "거래명세서 발행구분",
    "size": 300,
    "formatter": ""
  },
  {
    "name": "비고1",
    "displayname": "비고1",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "비고4",
    "displayname": "비고4",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "비고5",
    "displayname": "비고5",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "비고6",
    "displayname": "비고6",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "비고7",
    "displayname": "비고7",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "비고8",
    "displayname": "비고8",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "비고9",
    "displayname": "비고9",
    "size": 100,
    "formatter": ""
  },
  {
    "name": "비고10",
    "displayname": "비고10",
    "size": 100,
    "formatter": ""
  }
];
var vendor_data = [
  {
    "no": 1,
    "거래처구분": "",
    "국내업체명": "A업체",
    "성명": "강아지",
    "부서": "관리부",
    "직책": "",
    "당사 담당자": "김삼순",
    "휴대전화": "010-000-6999",
    "전화": "031-000-6999",
    "FAX": "031-123-1233",
    "대표 E-Mail": "",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "",
    "업체명\n(사업자등록증)": "",
    "대표자": "",
    "주소": "",
    "업태": "",
    "종목": "",
    "사전송금\n대상": "대상",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "",
    "MSDS\n제공방법": "",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  },
  {
    "no": 2,
    "거래처구분": "매입",
    "국내업체명": "B무역",
    "성명": "강감찬",
    "부서": "무역부",
    "직책": "",
    "당사 담당자": "김삼순",
    "휴대전화": "010-000-7000",
    "전화": "031-000-7000",
    "FAX": "031-123-1234",
    "대표 E-Mail": "1115@daum.net",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "128-86-63952",
    "업체명\n(사업자등록증)": "주식회사 엔씨비",
    "대표자": "차휘진",
    "주소": "경기도 고양시 일산동구 호수로 358-39(백석동, 동문굿모닝타워 1차 401호)",
    "업태": "도소매",
    "종목": "과학교재 및 의료기기",
    "사전송금\n대상": "대상",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "택배",
    "MSDS\n제공방법": "이메일",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  },
  {
    "no": 3,
    "거래처구분": "",
    "국내업체명": "C유통",
    "성명": "이성계",
    "부서": "",
    "직책": "",
    "당사 담당자": "김삼순", 
    "휴대전화": "010-000-7001",
    "전화": "031-000-7001",
    "FAX": "031-123-1235",
    "대표 E-Mail": "",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "",
    "업체명\n(사업자등록증)": "",
    "대표자": "",
    "주소": "",
    "업태": "",
    "종목": "",
    "사전송금\n대상": "",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "",
    "MSDS\n제공방법": "",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  },
  {
    "no": 4,
    "거래처구분": "매출",
    "국내업체명": "D전산",
    "성명": "김일",
    "부서": "",
    "직책": "",
    "당사 담당자": "김삼순", 
    "휴대전화": "010-000-7002",
    "전화": "031-000-7002",
    "FAX": "031-123-1236",
    "대표 E-Mail": "",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "",
    "업체명\n(사업자등록증)": "",
    "대표자": "",
    "주소": "",
    "업태": "",
    "종목": "",
    "사전송금\n대상": "",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "",
    "MSDS\n제공방법": "",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  },
  {
    "no": 5,
    "거래처구분": "",
    "국내업체명": "E산업",
    "성명": "김이",
    "부서": "",
    "직책": "",
    "당사 담당자": "김삼순", 
    "휴대전화": "010-000-7003",
    "전화": "031-000-7003",
    "FAX": "031-123-1237",
    "대표 E-Mail": "",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "",
    "업체명\n(사업자등록증)": "",
    "대표자": "",
    "주소": "",
    "업태": "",
    "종목": "",
    "사전송금\n대상": "",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "",
    "MSDS\n제공방법": "",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  },
  {
    "no": 6,
    "거래처구분": "",
    "국내업체명": "F정밀기계공업",
    "성명": "김삼순",
    "부서": "",
    "직책": "",
    "당사 담당자": "김삼순", 
    "휴대전화": "010-000-7004",
    "전화": "031-000-7004",
    "FAX": "031-123-1238",
    "대표 E-Mail": "",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "",
    "업체명\n(사업자등록증)": "",
    "대표자": "",
    "주소": "",
    "업태": "",
    "종목": "",
    "사전송금\n대상": "",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "",
    "MSDS\n제공방법": "",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  },
  {
    "no": 7,
    "거래처구분": "",
    "국내업체명": "B업무처리공사",
    "성명": "",
    "부서": "",
    "직책": "",
    "당사 담당자": "김삼순", 
    "휴대전화": "",
    "전화": "",
    "FAX": "",
    "대표 E-Mail": "",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "",
    "업체명\n(사업자등록증)": "",
    "대표자": "",
    "주소": "",
    "업태": "",
    "종목": "",
    "사전송금\n대상": "",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "",
    "MSDS\n제공방법": "",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  },
  {
    "no": 8,
    "거래처구분": "매출",
    "국내업체명": "A업무처리사",
    "성명": "",
    "부서": "",
    "직책": "",
    "당사 담당자": "김삼순", 
    "휴대전화": "",
    "전화": "",
    "FAX": "",
    "대표 E-Mail": "",
    "E-Mail\n(세금계산서)": "",
    "사업자번호": "",
    "업체명\n(사업자등록증)": "",
    "대표자": "",
    "주소": "",
    "업태": "",
    "종목": "",
    "사전송금\n대상": "",
    "비고표시": "",
    "배송안내\n메일구분": "",
    "배송방법": "",
    "MSDS\n제공방법": "",
    "계산서발행구분": "",
    "계산서발행시기": "",
    "배송주소": "",
    "우편번호": "",
    "거래명세서 발행구분": "",
    "비고1": "",
    "비고4": "",
    "비고5": "",
    "비고6": "",
    "비고7": "",
    "비고8": "",
    "비고9": "",
    "비고10": ""
  }
];
